espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>MISC_CONF</name>
          <description>reserved</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHBM_RST_INTER</name>
              <description>Write 1 and then 0 to reset the internal AHB FSM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_PRI_DIS</name>
              <description>Configures whether to disable the fixed-priority channel arbitration.\\0: Enable\\1: Disable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures clock gating.\\0: Support clock only when the application writes registers.\\ 1: Always force the clock on for registers.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0xC0</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>CH%s</name>
          <description>Cluster CH%s, containing IN_CONF0_CH?, IN_CONF1_CH?, INFIFO_STATUS_CH?, IN_POP_CH?, IN_LINK_CH?, IN_STATE_CH?, IN_SUC_EOF_DES_ADDR_CH?, IN_ERR_EOF_DES_ADDR_CH?, IN_DSCR_CH?, IN_DSCR_BF0_CH?, IN_DSCR_BF1_CH?, IN_PRI_CH?, IN_PERI_SEL_CH?, OUT_CONF0_CH?, OUT_CONF1_CH?, OUTFIFO_STATUS_CH?, OUT_PUSH_CH?, OUT_LINK_CH?, OUT_STATE_CH?, OUT_EOF_DES_ADDR_CH?, OUT_EOF_BFR_DES_ADDR_CH?, OUT_DSCR_CH?, OUT_DSCR_BF0_CH?, OUT_DSCR_BF1_CH?, OUT_PRI_CH?, OUT_PERI_SEL_CH?</description>
          <addressOffset>0x70</addressOffset>
          <register>
            <name>IN_CONF0</name>
            <description>Configuration register 0 of RX channel 0</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_RST</name>
                <description>Write 1 and then 0 to reset AHB_DMA channel 0 RX FSM and RX FIFO pointer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_LOOP_TEST</name>
                <description>reserved</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INDSCR_BURST_EN</name>
                <description>Configures whether to enable INCR burst transfer for RX channel 0 to read descriptors.\\0: Disable\\1: Enable\\</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MEM_TRANS_EN</name>
                <description>Configures whether to enable memory-to-memory data transfer.\\0: Disable\\1: Enable\\</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_ETM_EN</name>
                <description>Configures whether to enable ETM control for RX channel0.\\0: Disable\\1: Enable\\</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DATA_BURST_MODE_SEL</name>
                <description>Configures max burst size for Rx channel0.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DATA_BURST_EN</name>
                <description>Configures whether or not to enable INCR burst transfer for RX channel %s</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_CONF1</name>
            <description>Configuration register 1 of RX channel 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_CHECK_OWNER</name>
                <description>Configures whether to enable owner bit check for RX channel 0.\\0: Disable\\1: Enable\\</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INFIFO_STATUS</name>
            <description>Receive FIFO status of RX channel 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x07800003</resetValue>
            <fields>
              <field>
                <name>INFIFO_FULL</name>
                <description>Represents whether L1 RX FIFO is full.\\0: Not Full\\1: Full\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_EMPTY</name>
                <description>Represents whether L1 RX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_CNT</name>
                <description>Represents the number of data bytes in L1 RX FIFO for RX channel 0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_1B</name>
                <description>reserved</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_2B</name>
                <description>reserved</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_3B</name>
                <description>reserved</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_4B</name>
                <description>reserved</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_BUF_HUNGRY</name>
                <description>reserved</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_POP</name>
            <description>Receive FIFO status of RX channel 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000800</resetValue>
            <fields>
              <field>
                <name>INFIFO_RDATA</name>
                <description>Represents the data popped from AHB_DMA FIFO.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_POP</name>
                <description>Configures whether to pop data from AHB_DMA FIFO.\\0: Invalid. No effect\\1: Pop\\</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_LINK</name>
            <description>Receive FIFO status of RX channel 0</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000011</resetValue>
            <fields>
              <field>
                <name>INLINK_AUTO_RET</name>
                <description>Configures whether to return to current receive descriptor's address when there are some errors in current receiving data.\\0: Not return\\1: Return\\.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINK_STOP</name>
                <description>Configures whether to stop AHB_DMA's RX channel 0 from receiving data.\\0: Invalid. No effect\\1: Stop\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>INLINK_START</name>
                <description>Configures whether to enable AHB_DMA's RX channel 0 for data transfer.\\0: Disable\\1: Enable\\</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>INLINK_RESTART</name>
                <description>Configures whether to restart RX channel 0 for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>INLINK_PARK</name>
                <description>Represents the status of the receive descriptor's FSM.\\0: Running\\1: Idle\\</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_STATE</name>
            <description>Receive status of RX channel 0</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_ADDR</name>
                <description>reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_DSCR_STATE</name>
                <description>reserved</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_STATE</name>
                <description>Represents the address of the lower 18 bits of the next receive descriptor to be processed.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_SUC_EOF_DES_ADDR</name>
            <description>Receive descriptor address when EOF occurs on RX channel 0</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_SUC_EOF_DES_ADDR</name>
                <description>Represents the address of the receive descriptor when the EOF bit in this descriptor is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_ERR_EOF_DES_ADDR</name>
            <description>Receive descriptor address when errors occur of RX channel 0</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_ERR_EOF_DES_ADDR</name>
                <description>Represents the address of the receive descriptor when there are some errors in the currently received data.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR</name>
            <description>Current receive descriptor address of RX channel 0</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR</name>
                <description>Represents the address of the next receive descriptor x+1 pointed by the current receive descriptor that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR_BF0</name>
            <description>The last receive descriptor address of RX channel 0</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_BF0</name>
                <description>Represents the address of the current receive descriptor x that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR_BF1</name>
            <description>The second-to-last receive descriptor address of RX channel 0</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_BF1</name>
                <description>Represents the address of the previous receive descriptor x-1 that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_PRI</name>
            <description>Priority register of RX channel 0</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>RX_PRI</name>
                <description>Configures the priority of RX channel 0.The larger of the value, the higher of the priority..</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_PERI_SEL</name>
            <description>Peripheral selection register of RX channel 0</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000003F</resetValue>
            <fields>
              <field>
                <name>PERI_IN_SEL</name>
                <description>Configures the peripheral connected to RX channel 0.\\ 0: Dummy\\ 1: SPI2\\ 2: UHCI0\\ 3: I2S0\\ 4: Dummy\\ 5: Dummy\\ 6: AES\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\ 10: Dummy\\ 11~15: Dummy\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_CONF0</name>
            <description>Configuration register 0 of TX channel 0</description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000008</resetValue>
            <fields>
              <field>
                <name>OUT_RST</name>
                <description>Configures the reset state of AHB_DMA channel 0 TX FSM and TX FIFO pointer.\\0: Release reset\\1: Reset\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_LOOP_TEST</name>
                <description>reserved</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_AUTO_WRBACK</name>
                <description>Configures whether to enable automatic outlink write-back when all the data in TX FIFO has been transmitted.\\0: Disable\\1: Enable\\</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EOF_MODE</name>
                <description>Configures when to generate EOF flag.\\0: EOF flag for TX channel 0 is generated when data to be transmitted has been pushed into FIFO in AHB_DMA.\\ 1: EOF flag for TX channel 0 is generated when data to be transmitted has been popped from FIFO in AHB_DMA.\\</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTDSCR_BURST_EN</name>
                <description>Configures whether to enable INCR burst transfer for TX channel 0 reading descriptors.\\0: Disable\\1: Enable\\</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_ETM_EN</name>
                <description>Configures whether to enable ETM control for TX channel 0.\\0: Disable\\1: Enable\\</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DATA_BURST_MODE_SEL</name>
                <description>Configures max burst size for TX channel0.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DATA_BURST_EN</name>
                <description>Configures whether or not to enable INCR burst transfer for TX channel %s</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_CONF1</name>
            <description>Configuration register 1 of TX channel 0</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_CHECK_OWNER</name>
                <description>Configures whether to enable owner bit check for TX channel 0.\\0: Disable\\1: Enable\\</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUTFIFO_STATUS</name>
            <description>Receive FIFO status of RX channel 0</description>
            <addressOffset>0x68</addressOffset>
            <size>0x20</size>
            <resetValue>0x07800002</resetValue>
            <fields>
              <field>
                <name>OUTFIFO_FULL</name>
                <description>Represents whether L1 TX FIFO is full.\\0: Not Full\\1: Full\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_EMPTY</name>
                <description>Represents whether L1 TX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_CNT</name>
                <description>Represents the number of data bytes in L1 TX FIFO for TX channel 0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_1B</name>
                <description>reserved</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_2B</name>
                <description>reserved</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_3B</name>
                <description>reserved</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_4B</name>
                <description>reserved</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
