espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
          <register>
            <name>OUT_PUSH</name>
            <description>Push control register of TX channel 0</description>
            <addressOffset>0x6C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTFIFO_WDATA</name>
                <description>Configures whether to push data into AHB_DMA FIFO.\\0: Invalid. No effect\\1: Push\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_PUSH</name>
                <description>Configures the data that need to be pushed into AHB_DMA FIFO.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_LINK</name>
            <description>Push control register of TX channel 0</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000008</resetValue>
            <fields>
              <field>
                <name>OUTLINK_STOP</name>
                <description>Configures whether to stop AHB_DMA's TX channel 0 from transmitting data.\\0: Invalid. No effect\\1: Stop\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_START</name>
                <description>Configures whether to enable AHB_DMA's TX channel 0 for data transfer.\\0: Disable\\1: Enable\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_RESTART</name>
                <description>Configures whether to restart TX channel 0 for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_PARK</name>
                <description>Represents the status of the transmit descriptor's FSM.\\0: Running\\1: Idle\\</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_STATE</name>
            <description>Transmit status of TX channel 0</description>
            <addressOffset>0x74</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_ADDR</name>
                <description>Represents the lower 18 bits of the address of the next transmit descriptor to be processed.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_DSCR_STATE</name>
                <description>reserved</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_STATE</name>
                <description>reserved</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_EOF_DES_ADDR</name>
            <description>Transmit descriptor address when EOF occurs on TX channel 0</description>
            <addressOffset>0x78</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_EOF_DES_ADDR</name>
                <description>Represents the address of the transmit descriptor when the EOF bit in this descriptor is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_EOF_BFR_DES_ADDR</name>
            <description>The last transmit descriptor address when EOF occurs on TX channel 0</description>
            <addressOffset>0x7C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_EOF_BFR_DES_ADDR</name>
                <description>Represents the address of the transmit descriptor before the last transmit descriptor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR</name>
            <description>Current transmit descriptor address of TX channel 0</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR</name>
                <description>Represents the address of the next transmit descriptor y+1 pointed by the current transmit descriptor that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR_BF0</name>
            <description>The last transmit descriptor address of TX channel 0</description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_BF0</name>
                <description>Represents the address of the current transmit descriptor y that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR_BF1</name>
            <description>The second-to-last transmit descriptor address of TX channel 0</description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_BF1</name>
                <description>Represents the address of the previous transmit descriptor y-1 that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PRI</name>
            <description>Priority register of TX channel 0</description>
            <addressOffset>0x8C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_PRI</name>
                <description>Configures the priority of TX channel 0.The larger of the value, the higher of the priority..</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PERI_SEL</name>
            <description>Peripheral selection register of TX channel 0</description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000003F</resetValue>
            <fields>
              <field>
                <name>PERI_OUT_SEL</name>
                <description>Configures the peripheral connected to TX channel 0.\\ 0: Dummy\\ 1: SPI2\\ 2: UHCI0\\ 3: I2S0\\ 4: Dummy\\ 5: Dummy\\ 6: AES\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\ 10: Dummy\\ 11~15: Dummy\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>IN_DONE_DES_ADDR_CH0</name>
          <description>RX_done Inlink descriptor address of RX channel 0</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH0</name>
              <description>Represents the address of the inlink descriptor when  this descriptor is completed .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DONE_DES_ADDR_CH0</name>
          <description>TX done outlink descriptor address of TX channel 0</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_DONE_DES_ADDR_CH0</name>
              <description>Represents the address of the outlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DONE_DES_ADDR_CH1</name>
          <description>RX_done Inlink descriptor address of RX channel 1</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH1</name>
              <description>Represents the address of the inlink descriptor when  this descriptor is completed .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DONE_DES_ADDR_CH1</name>
          <description>TX done outlink descriptor address of TX channel 1</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_DONE_DES_ADDR_CH1</name>
              <description>Represents the address of the outlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CH_ARB_WEIGHT_CH0</name>
          <description>TX channel 0 arbitration weight configuration register</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_VALUE_CH0</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ARB_WEIGHT_OPT_DIR_CH0</name>
          <description>TX channel 0 weight arbitration optimization enable register</description>
          <addressOffset>0x2E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_OPT_DIS_CH0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CH_ARB_WEIGHT_CH1</name>
          <description>TX channel 1 arbitration weight configuration register</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_VALUE_CH1</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ARB_WEIGHT_OPT_DIR_CH1</name>
          <description>TX channel 1 weight arbitration optimization enable register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_OPT_DIS_CH1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH_ARB_WEIGHT_CH0</name>
          <description>RX channel 0 arbitration weight configuration register</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_VALUE_CH0</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ARB_WEIGHT_OPT_DIR_CH0</name>
          <description>RX channel 0 weight arbitration optimization enable register</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_OPT_DIS_CH0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH_ARB_WEIGHT_CH1</name>
          <description>RX channel 1 arbitration weight configuration register</description>
          <addressOffset>0x37C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_VALUE_CH1</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ARB_WEIGHT_OPT_DIR_CH1</name>
          <description>RX channel 1 weight arbitration optimization enable register</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_OPT_DIS_CH1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>IN_LINK_ADDR_CH%s</name>
          <description>Link list descriptor address configuration of RX channel %s</description>
          <addressOffset>0x3AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INLINK_ADDR</name>
              <description>Configures the 32 bits of the first receive descriptor's address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>OUT_LINK_ADDR_CH%s</name>
          <description>Link list descriptor address configuration of TX channel %s</description>
          <addressOffset>0x3B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_START_ADDR</name>
          <description>Accessible address space start address configuration register</description>
          <addressOffset>0x3C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_START_ADDR</name>
              <description>Accessible address space start address configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_END_ADDR</name>
          <description>Accessible address space end address configuration register</description>
          <addressOffset>0x3C8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_END_ADDR</name>
              <description>Configures the end address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT_TX</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x3CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ARB_TIMEOUT_TX</name>
              <description>Configures the time slot for TX. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT_RX</name>
          <description>RX arbitration timeout configuration register</description>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ARB_TIMEOUT_RX</name>
              <description>Configures the time slot for RX. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN_TX</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WEIGHT_EN_TX</name>
              <description>Configures whether to enable weight arbitration for TX.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN_RX</name>
          <description>RX weight arbitration enable register</description>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WEIGHT_EN_RX</name>
              <description>Configures whether to enable weight arbitration for RX.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NUM</name>
              <description>Configures the time slot. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WEIGHT_EN</name>
              <description>Configures whether to enable weight arbitration.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
