espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
          <register>
            <name>INTR_RAW</name>
            <description>core0 monitor interrupt status register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_DRAM0_0_RD_RAW</name>
                <description>The raw interrupt status of read operations in region 0 by Data bus.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AREA_DRAM0_0_WR_RAW</name>
                <description>The raw interrupt status of write operations in region 0 by Data bus.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AREA_DRAM0_1_RD_RAW</name>
                <description>The raw interrupt status of read operations in region 1 by Data bus.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AREA_DRAM0_1_WR_RAW</name>
                <description>The raw interrupt status of write operations in region 1 by Data bus.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AREA_PIF_0_RD_RAW</name>
                <description>The raw interrupt status of read operations in region 0 by Peripheral bus.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AREA_PIF_0_WR_RAW</name>
                <description>The raw interrupt status of write operations in region 0 by Peripheral bus.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AREA_PIF_1_RD_RAW</name>
                <description>The raw interrupt status of read operations in region 1 by Peripheral bus.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AREA_PIF_1_WR_RAW</name>
                <description>The raw interrupt status of write operations in region 1 by Peripheral bus.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SP_SPILL_MIN_RAW</name>
                <description>The raw interrupt status of SP exceeding the lower bound address of SP monitored region.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SP_SPILL_MAX_RAW</name>
                <description>The raw interrupt status of SP exceeding the upper bound address of SP monitored region.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IRAM0_EXCEPTION_MONITOR_RAW</name>
                <description>IBUS busy monitor interrupt status</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DRAM0_EXCEPTION_MONITOR_RAW</name>
                <description>DBUS busy monitor initerrupt status</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IRAM0_EXCEPTION_MONITOR_0</name>
            <description>exception monitor status register0</description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IRAM0_RECORDING_ADDR_0</name>
                <description>reg_core_0_iram0_recording_addr_0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IRAM0_RECORDING_WR_0</name>
                <description>reg_core_0_iram0_recording_wr_0</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IRAM0_RECORDING_LOADSTORE_0</name>
                <description>reg_core_0_iram0_recording_loadstore_0</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IRAM0_EXCEPTION_MONITOR_1</name>
            <description>exception monitor status register1</description>
            <addressOffset>0x54</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IRAM0_RECORDING_ADDR_1</name>
                <description>reg_core_0_iram0_recording_addr_1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IRAM0_RECORDING_WR_1</name>
                <description>reg_core_0_iram0_recording_wr_1</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IRAM0_RECORDING_LOADSTORE_1</name>
                <description>reg_core_0_iram0_recording_loadstore_1</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LASTPC_BEFORE_EXCEPTION</name>
            <description>cpu status register</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>LASTPC_BEFORE_EXC</name>
                <description>Represents the PC of the last command before the HP CPU enters exception.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONTR_ENA</name>
            <description>core0 monitor enable configuration register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_DRAM0_0_RD_ENA</name>
                <description>Configures whether to monitor read operations in region 0 by the Data bus. \\
0: Not monitor\\
1: Monitor\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_DRAM0_0_WR_ENA</name>
                <description>Configures whether to monitor write operations in region 0 by the Data bus.\\
0: Not monitor\\
1: Monitor\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_DRAM0_1_RD_ENA</name>
                <description>Configures whether to monitor read operations in region 1 by the Data bus.\\
0: Not Monitor\\
1: Monitor\\</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_DRAM0_1_WR_ENA</name>
                <description>Configures whether to monitor write operations in region 1 by the Data bus.\\
0: Not Monitor\\
1: Monitor\\</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_PIF_0_RD_ENA</name>
                <description>Configures whether to monitor read operations in region 0 by the Peripheral bus.\\
0: Not Monitor\\
1: Monitor\\</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_PIF_0_WR_ENA</name>
                <description>Configures whether to monitor write operations in region 0 by the Peripheral bus.\\
0: Not Monitor\\
1: Monitor\\</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_PIF_1_RD_ENA</name>
                <description>Configures whether to monitor read operations in region 1 by the Peripheral bus.\\
0: Not Monitor\\
1: Monitor\\</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_PIF_1_WR_ENA</name>
                <description>Configures whether to monitor write operations in region 1 by the Peripheral bus.\\
0: Not Monitor\\
1: Monitor\\</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SP_SPILL_MIN_ENA</name>
                <description>Configures whether to monitor SP exceeding the lower bound address of SP monitored region.\\
0: Not Monitor\\
1: Monitor\\</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SP_SPILL_MAX_ENA</name>
                <description>Configures whether to monitor SP exceeding the upper bound address of SP monitored region.\\
0: Not Monitor\\
1: Monitor\\</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IRAM0_EXCEPTION_MONITOR_ENA</name>
                <description>IBUS busy monitor enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DRAM0_EXCEPTION_MONITOR_ENA</name>
                <description>DBUS busy monitor enbale</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCD_EN</name>
            <description>HP CPU PC logging enable register</description>
            <addressOffset>0x44</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>RCD_RECORDEN</name>
                <description>Configures whether to enable PC logging.\\
0: Disable\\
1: ASSIST_DEBUG_CORE_0_RCD_PDEBUGPC_REG starts to record PC in real time\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RCD_PDEBUGEN</name>
                <description>Configures whether to enable HP CPU debugging.\\
0: Disable\\
1: HP CPU outputs PC\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCD_PDEBUGPC</name>
            <description>PC logging register</description>
            <addressOffset>0x48</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>RCD_PDEBUGPC</name>
                <description>Represents the PC value at HP CPU reset.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCD_PDEBUGSP</name>
            <description>PC logging register</description>
            <addressOffset>0x4C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>RCD_PDEBUGSP</name>
                <description>Represents SP.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SP_MAX</name>
            <description>Configures stack monitoring upper boundary address</description>
            <addressOffset>0x3C</addressOffset>
            <size>0x20</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>SP_MAX</name>
                <description>Configures the upper bound address of SP.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SP_MIN</name>
            <description>Configures stack monitoring lower boundary address</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>SP_MIN</name>
                <description>Configures the lower bound address of SP.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SP_PC</name>
            <description>Stack monitoring HP CPU PC status register</description>
            <addressOffset>0x40</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>SP_PC</name>
                <description>Represents the PC value during stack monitoring.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_4</name>
          <description>exception monitor status register6</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_ADDR_1</name>
              <description>reg_core_0_dram0_recording_addr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_5</name>
          <description>exception monitor status register7</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_PC_1</name>
              <description>reg_core_0_dram0_recording_pc_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR%s</name>
          <description>`¯\_(ツ)_/¯`</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LIMIT_CYCLE_0</name>
              <description>reg_core_x_iram0_dram0_limit_cycle_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Register clock control</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to enable the register clock gating. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
