espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>CACHE_MISS_ACCESS_CTRL</name>
          <description>Cache wrap around control register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_MISS_DISABLE_ACCESS</name>
              <description>Set this bit as 1 to disable early restart of  L1-ICache0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_MISS_DISABLE_ACCESS</name>
              <description>Set this bit as 1 to disable early restart of  L1-ICache1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_MISS_DISABLE_ACCESS</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_MISS_DISABLE_ACCESS</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_MISS_DISABLE_ACCESS</name>
              <description>Set this bit as 1 to disable early restart of L1-DCache</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_FREEZE_CTRL</name>
          <description>Cache Freeze control register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_FREEZE_EN</name>
              <description>The bit is used to enable freeze operation on L1-ICache0. It can be cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE0_FREEZE_MODE</name>
              <description>The bit is used to configure mode of freeze operation L1-ICache0. 0: a miss-access will not stuck. 1: a miss-access will stuck.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE0_FREEZE_DONE</name>
              <description>The bit is used to indicate whether freeze operation on L1-ICache0 is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_FREEZE_EN</name>
              <description>The bit is used to enable freeze operation on L1-ICache1. It can be cleared by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_FREEZE_MODE</name>
              <description>The bit is used to configure mode of freeze operation L1-ICache1. 0: a miss-access will not stuck. 1: a miss-access will stuck.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_FREEZE_DONE</name>
              <description>The bit is used to indicate whether freeze operation on L1-ICache1 is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_FREEZE_EN</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_FREEZE_MODE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_FREEZE_DONE</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_FREEZE_EN</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_FREEZE_MODE</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_FREEZE_DONE</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_FREEZE_EN</name>
              <description>The bit is used to enable freeze operation on L1-Cache. It can be cleared by software.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_FREEZE_MODE</name>
              <description>The bit is used to configure mode of freeze operation L1-Cache. 0: a miss-access will not stuck. 1: a miss-access will stuck.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_FREEZE_DONE</name>
              <description>The bit is used to indicate whether freeze operation on L1-Cache is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_DATA_MEM_ACS_CONF</name>
          <description>Cache data memory access configure register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_DATA_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-ICache0 data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE0_DATA_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-ICache0 data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_DATA_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-ICache1 data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_DATA_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-ICache1 data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_DATA_MEM_RD_EN</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_DATA_MEM_WR_EN</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_DATA_MEM_RD_EN</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_DATA_MEM_WR_EN</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_DATA_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-Cache data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_DATA_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-Cache data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_TAG_MEM_ACS_CONF</name>
          <description>Cache tag memory access configure register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_TAG_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-ICache0 tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE0_TAG_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-ICache0 tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_TAG_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-ICache1 tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_TAG_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-ICache1 tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_TAG_MEM_RD_EN</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_TAG_MEM_WR_EN</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_TAG_MEM_RD_EN</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_TAG_MEM_WR_EN</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_TAG_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-Cache tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_TAG_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-Cache tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE0_PRELOCK_CONF</name>
          <description>L1 instruction Cache 0 prelock configure register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_PRELOCK_SCT0_EN</name>
              <description>The bit is used to enable the first section of prelock function on L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE0_PRELOCK_SCT1_EN</name>
              <description>The bit is used to enable the second section of prelock function on L1-ICache0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE0_PRELOCK_RGID</name>
              <description>The bit is used to set  the gid of l1 icache0 prelock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE0_PRELOCK_SCT0_ADDR</name>
          <description>L1 instruction Cache 0 prelock section0 address configure register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_PRELOCK_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section of prelock on L1-ICache0, which should be used together with L1_ICACHE0_PRELOCK_SCT0_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE0_PRELOCK_SCT1_ADDR</name>
          <description>L1 instruction Cache 0 prelock section1 address configure register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_PRELOCK_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section of prelock on L1-ICache0, which should be used together with L1_ICACHE0_PRELOCK_SCT1_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE0_PRELOCK_SCT_SIZE</name>
          <description>L1 instruction Cache 0 prelock section size configure register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x3FFF3FFF</resetValue>
          <fields>
            <field>
              <name>ICACHE0_PRELOCK_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache0, which should be used together with L1_ICACHE0_PRELOCK_SCT0_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE0_PRELOCK_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section of prelock on L1-ICache0, which should be used together with L1_ICACHE0_PRELOCK_SCT1_ADDR_REG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE1_PRELOCK_CONF</name>
          <description>L1 instruction Cache 1 prelock configure register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE1_PRELOCK_SCT0_EN</name>
              <description>The bit is used to enable the first section of prelock function on L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_PRELOCK_SCT1_EN</name>
              <description>The bit is used to enable the second section of prelock function on L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_PRELOCK_RGID</name>
              <description>The bit is used to set  the gid of l1 icache1 prelock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE1_PRELOCK_SCT0_ADDR</name>
          <description>L1 instruction Cache 1 prelock section0 address configure register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE1_PRELOCK_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section of prelock on L1-ICache1, which should be used together with L1_ICACHE1_PRELOCK_SCT0_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE1_PRELOCK_SCT1_ADDR</name>
          <description>L1 instruction Cache 1 prelock section1 address configure register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE1_PRELOCK_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section of prelock on L1-ICache1, which should be used together with L1_ICACHE1_PRELOCK_SCT1_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE1_PRELOCK_SCT_SIZE</name>
          <description>L1 instruction Cache 1 prelock section size configure register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x3FFF3FFF</resetValue>
          <fields>
            <field>
              <name>ICACHE1_PRELOCK_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache1, which should be used together with L1_ICACHE1_PRELOCK_SCT0_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_PRELOCK_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section of prelock on L1-ICache1, which should be used together with L1_ICACHE1_PRELOCK_SCT1_ADDR_REG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_PRELOCK_CONF</name>
          <description>L1 instruction Cache 2 prelock configure register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE2_PRELOCK_SCT0_EN</name>
              <description>The bit is used to enable the first section of prelock function on L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_PRELOCK_SCT1_EN</name>
              <description>The bit is used to enable the second section of prelock function on L1-ICache2.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_PRELOCK_RGID</name>
              <description>The bit is used to set  the gid of l1 icache2 prelock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_PRELOCK_SCT0_ADDR</name>
          <description>L1 instruction Cache 2 prelock section0 address configure register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE2_PRELOCK_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section of prelock on L1-ICache2, which should be used together with L1_ICACHE2_PRELOCK_SCT0_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_PRELOCK_SCT1_ADDR</name>
          <description>L1 instruction Cache 2 prelock section1 address configure register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE2_PRELOCK_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section of prelock on L1-ICache2, which should be used together with L1_ICACHE2_PRELOCK_SCT1_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
