espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>IBUS1_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus1 accesses L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus1 accessing L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS2_ACS_HIT_CNT</name>
          <description>L1-ICache bus2 Hit-Access Counter register</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS2_HIT_CNT</name>
              <description>The register records the number of hits when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS2_ACS_MISS_CNT</name>
          <description>L1-ICache bus2 Miss-Access Counter register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS2_MISS_CNT</name>
              <description>The register records the number of missing when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS2_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS3_ACS_HIT_CNT</name>
          <description>L1-ICache bus3 Hit-Access Counter register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS3_HIT_CNT</name>
              <description>The register records the number of hits when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS3_ACS_MISS_CNT</name>
          <description>L1-ICache bus3 Miss-Access Counter register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS3_MISS_CNT</name>
              <description>The register records the number of missing when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS3_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS0_ACS_HIT_CNT</name>
          <description>L1-Cache bus0 Hit-Access Counter register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS0_HIT_CNT</name>
              <description>The register records the number of hits when bus0 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS0_ACS_MISS_CNT</name>
          <description>L1-Cache bus0 Miss-Access Counter register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS0_MISS_CNT</name>
              <description>The register records the number of missing when bus0 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS0_ACS_CONFLICT_CNT</name>
          <description>L1-Cache bus0 Conflict-Access Counter register</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS0_CONFLICT_RD_CNT</name>
              <description>The register records the number of access-conflicts when bus0 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L1-Cache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-Cache accesses L2-Cache due to bus0 accessing L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS0_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus0 WB-Access Counter register</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS0_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus0 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS1_ACS_HIT_CNT</name>
          <description>L1-Cache bus1 Hit-Access Counter register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS1_HIT_CNT</name>
              <description>The register records the number of hits when bus1 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS1_ACS_MISS_CNT</name>
          <description>L1-Cache bus1 Miss-Access Counter register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS1_MISS_CNT</name>
              <description>The register records the number of missing when bus1 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS1_ACS_CONFLICT_CNT</name>
          <description>L1-Cache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus1 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-Cache accesses L2-Cache due to bus1 accessing L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS1_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus1 WB-Access Counter register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS1_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus1 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS2_ACS_HIT_CNT</name>
          <description>L1-DCache bus2 Hit-Access Counter register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS2_HIT_CNT</name>
              <description>The register records the number of hits when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS2_ACS_MISS_CNT</name>
          <description>L1-DCache bus2 Miss-Access Counter register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS2_MISS_CNT</name>
              <description>The register records the number of missing when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS2_ACS_CONFLICT_CNT</name>
          <description>L1-DCache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-Cache accesses L2-Cache due to bus2 accessing L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS2_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus2 WB-Access Counter register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS2_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus2 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS3_ACS_HIT_CNT</name>
          <description>L1-DCache bus3 Hit-Access Counter register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS3_HIT_CNT</name>
              <description>The register records the number of hits when bus3 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS3_ACS_MISS_CNT</name>
          <description>L1-DCache bus3 Miss-Access Counter register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS3_MISS_CNT</name>
              <description>The register records the number of missing when bus3 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS3_ACS_CONFLICT_CNT</name>
          <description>L1-DCache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus3 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-Cache accesses L2-Cache due to bus3 accessing L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS3_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus3 WB-Access Counter register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBUS3_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus0 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE0_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE0_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE0_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE1_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE1_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE1_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE1_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE2_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE2_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE3_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE3_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache3 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache3 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
