espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>CACHE_PRELOAD_RST_CTRL</name>
          <description>Cache Preload Reset control register</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_PLD_RST</name>
              <description>set this bit to reset preload-logic inside L1-ICache0. Recommend that this should only be used to initialize preload-logic when some fatal error of preload-logic occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_PLD_RST</name>
              <description>set this bit to reset preload-logic inside L1-ICache1. Recommend that this should only be used to initialize preload-logic when some fatal error of preload-logic occurs.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_PLD_RST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_PLD_RST</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_PLD_RST</name>
              <description>set this bit to reset preload-logic inside L1-Cache. Recommend that this should only be used to initialize preload-logic when some fatal error of preload-logic occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_AUTOLOAD_BUF_CLR_CTRL</name>
          <description>Cache Autoload buffer clear control register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_ALD_BUF_CLR</name>
              <description>set this bit to clear autoload-buffer inside L1-ICache0. If this bit is active, autoload will not work in L1-ICache0. This bit should not be active when autoload works in L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_ALD_BUF_CLR</name>
              <description>set this bit to clear autoload-buffer inside L1-ICache1. If this bit is active, autoload will not work in L1-ICache1. This bit should not be active when autoload works in L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_ALD_BUF_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_ALD_BUF_CLR</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_ALD_BUF_CLR</name>
              <description>set this bit to clear autoload-buffer inside L1-Cache. If this bit is active, autoload will not work in L1-Cache. This bit should not be active when autoload works in L1-Cache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNALLOCATE_BUFFER_CLEAR</name>
          <description>Unallocate request buffer clear registers</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_UNALLOC_CLR</name>
              <description>The bit is used to clear the unallocate request buffer of l1 icache0 where the unallocate request is responsed but not completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE1_UNALLOC_CLR</name>
              <description>The bit is used to clear the unallocate request buffer of l1 icache1 where the unallocate request is responsed but not completed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_UNALLOC_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE3_UNALLOC_CLR</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_UNALLOC_CLR</name>
              <description>The bit is used to clear the unallocate request buffer of l1 cache where the unallocate request is responsed but not completed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_OBJECT_CTRL</name>
          <description>Cache Tag and Data memory Object control register</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICACHE0_TAG_OBJECT</name>
              <description>Set this bit to set L1-ICache0 tag memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE1_TAG_OBJECT</name>
              <description>Set this bit to set L1-ICache1 tag memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_TAG_OBJECT</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE3_TAG_OBJECT</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_TAG_OBJECT</name>
              <description>Set this bit to set L1-Cache tag memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE0_MEM_OBJECT</name>
              <description>Set this bit to set L1-ICache0 data memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE1_MEM_OBJECT</name>
              <description>Set this bit to set L1-ICache1 data memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_MEM_OBJECT</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE3_MEM_OBJECT</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_MEM_OBJECT</name>
              <description>Set this bit to set L1-Cache data memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_WAY_OBJECT</name>
          <description>Cache Tag and Data memory way register</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_WAY_OBJECT</name>
              <description>Set this bits to select which way of the tag-object will be accessed. 0: way0, 1: way1, 2: way2, 3: way3, ?, 7: way7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ADDR</name>
          <description>Cache address register</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_ADDR</name>
              <description>Those bits stores the address which will decide where inside the specified tag memory object will be accessed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_DEBUG_BUS</name>
          <description>Cache Tag/data memory content register</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000264</resetValue>
          <fields>
            <field>
              <name>CACHE_DEBUG_BUS</name>
              <description>This is a constant place where we can write data to or read data from the tag/data memory on the specified cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_LEVEL_SPLIT0</name>
          <description>USED TO SPLIT L1 CACHE AND L2 CACHE</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000268</resetValue>
          <fields>
            <field>
              <name>CACHE_LEVEL_SPLIT0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_CTRL</name>
          <description>L2 Cache(L2-Cache) control register</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_SHUT_DMA</name>
              <description>The bit is used to disable DMA access L2-Cache, 0: enable, 1: disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_UNDEF_OP</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_BYPASS_CACHE_CONF</name>
          <description>Bypass Cache configure register</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_BYPASS_L2_CACHE_EN</name>
              <description>The bit is used to enable bypass L2-Cache. 0: disable bypass, 1: enable bypass.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_CACHESIZE_CONF</name>
          <description>L2 Cache CacheSize mode configure register</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_256</name>
              <description>The field is used to configure cachesize of L2-Cache as 256 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_512</name>
              <description>The field is used to configure cachesize of L2-Cache as 512 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_1K</name>
              <description>The field is used to configure cachesize of L2-Cache as 1k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_2K</name>
              <description>The field is used to configure cachesize of L2-Cache as 2k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_4K</name>
              <description>The field is used to configure cachesize of L2-Cache as 4k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_8K</name>
              <description>The field is used to configure cachesize of L2-Cache as 8k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_16K</name>
              <description>The field is used to configure cachesize of L2-Cache as 16k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_32K</name>
              <description>The field is used to configure cachesize of L2-Cache as 32k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_64K</name>
              <description>The field is used to configure cachesize of L2-Cache as 64k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_128K</name>
              <description>The field is used to configure cachesize of L2-Cache as 128k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_256K</name>
              <description>The field is used to configure cachesize of L2-Cache as 256k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_512K</name>
              <description>The field is used to configure cachesize of L2-Cache as 512k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_CACHESIZE_1024K</name>
              <description>The field is used to configure cachesize of L2-Cache as 1024k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_BLOCKSIZE_CONF</name>
          <description>L2 Cache BlockSize mode configure register</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_BLOCKSIZE_8</name>
              <description>The field is used to configureblocksize of L2-Cache as 8 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_BLOCKSIZE_16</name>
              <description>The field is used to configureblocksize of L2-Cache as 16 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_BLOCKSIZE_32</name>
              <description>The field is used to configureblocksize of L2-Cache as 32 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_BLOCKSIZE_64</name>
              <description>The field is used to configureblocksize of L2-Cache as 64 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_BLOCKSIZE_128</name>
              <description>The field is used to configureblocksize of L2-Cache as 128 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_BLOCKSIZE_256</name>
              <description>The field is used to configureblocksize of L2-Cache as 256 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_WRAP_AROUND_CTRL</name>
          <description>Cache wrap around control register</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_WRAP</name>
              <description>Set this bit as 1 to enable L2-Cache wrap around mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_MISS_ACCESS_CTRL</name>
          <description>Cache wrap around control register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_MISS_DISABLE_ACCESS</name>
              <description>Set this bit as 1 to disable early restart of  L2-Cache</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_FREEZE_CTRL</name>
          <description>Cache Freeze control register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_FREEZE_EN</name>
              <description>The bit is used to enable freeze operation on L2-Cache. It can be cleared by software.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_FREEZE_MODE</name>
              <description>The bit is used to configure mode of freeze operation L2-Cache. 0: a miss-access will not stuck. 1: a miss-access will stuck.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_FREEZE_DONE</name>
              <description>The bit is used to indicate whether freeze operation on L2-Cache is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
