espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>CACHE_L2_CACHE_DATA_MEM_ACS_CONF</name>
          <description>Cache data memory access configure register</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_DATA_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L2-Cache data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_DATA_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L2-Cache data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_TAG_MEM_ACS_CONF</name>
          <description>Cache tag memory access configure register</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_TAG_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L2-Cache tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_TAG_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L2-Cache tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_PRELOCK_CONF</name>
          <description>L2 Cache prelock configure register</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PRELOCK_SCT0_EN</name>
              <description>The bit is used to enable the first section of prelock function on L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PRELOCK_SCT1_EN</name>
              <description>The bit is used to enable the second section of prelock function on L2-Cache.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PRELOCK_RGID</name>
              <description>The bit is used to set  the gid of l2 cache prelock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_PRELOCK_SCT0_ADDR</name>
          <description>L2 Cache prelock section0 address configure register</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PRELOCK_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT0_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_PRELOCK_SCT1_ADDR</name>
          <description>L2 Cache prelock section1 address configure register</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PRELOCK_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT1_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_PRELOCK_SCT_SIZE</name>
          <description>L2 Cache prelock section size configure register</description>
          <addressOffset>0x29C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PRELOCK_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT0_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PRELOCK_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT1_ADDR_REG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_PRELOAD_CTRL</name>
          <description>L2 Cache preload-operation control register</description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on L2-Cache. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l2 cache preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_PRELOAD_ADDR</name>
          <description>L2 Cache preload address configure register</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on L2-Cache, which should be used together with L2_CACHE_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_PRELOAD_SIZE</name>
          <description>L2 Cache preload size configure register</description>
          <addressOffset>0x2A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_CTRL</name>
          <description>L2 Cache autoload-operation control register</description>
          <addressOffset>0x2AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_ENA</name>
              <description>The bit is used to enable and disable autoload operation on L2-Cache.  1: enable, 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_DONE</name>
              <description>The bit is used to indicate whether autoload operation on L2-Cache is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_ORDER</name>
              <description>The bit is used to configure the direction of autoload operation on L2-Cache. 0: ascending. 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_TRIGGER_MODE</name>
              <description>The field is used to configure trigger mode of autoload operation on L2-Cache. 0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT0_ENA</name>
              <description>The bit is used to enable the first section for autoload operation on L2-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT1_ENA</name>
              <description>The bit is used to enable the second section for autoload operation on L2-Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT2_ENA</name>
              <description>The bit is used to enable the third section for autoload operation on L2-Cache.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT3_ENA</name>
              <description>The bit is used to enable the fourth section for autoload operation on L2-Cache.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_RGID</name>
              <description>The bit is used to set  the gid of l2 cache autoload.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR</name>
          <description>L2 Cache autoload section 0 address configure register</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT0_SIZE and L2_CACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE</name>
          <description>L2 Cache autoload section 0 size configure register</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT0_ADDR and L2_CACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR</name>
          <description>L2 Cache autoload section 1 address configure register</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT1_SIZE and L2_CACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE</name>
          <description>L2 Cache autoload section 1 size configure register</description>
          <addressOffset>0x2BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT1_ADDR and L2_CACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR</name>
          <description>L2 Cache autoload section 2 address configure register</description>
          <addressOffset>0x2C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR</name>
              <description>Those bits are used to configure the start address of the third section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT2_SIZE and L2_CACHE_AUTOLOAD_SCT2_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE</name>
          <description>L2 Cache autoload section 2 size configure register</description>
          <addressOffset>0x2C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE</name>
              <description>Those bits are used to configure the size of the third section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT2_ADDR and L2_CACHE_AUTOLOAD_SCT2_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR</name>
          <description>L2 Cache autoload section 3 address configure register</description>
          <addressOffset>0x2C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR</name>
              <description>Those bits are used to configure the start address of the fourth section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT3_SIZE and L2_CACHE_AUTOLOAD_SCT3_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE</name>
          <description>L2 Cache autoload section 3 size configure register</description>
          <addressOffset>0x2CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE</name>
              <description>Those bits are used to configure the size of the fourth section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT3_ADDR and L2_CACHE_AUTOLOAD_SCT3_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_ACS_CNT_INT_ENA</name>
          <description>Cache Access Counter Interrupt enable register</description>
          <addressOffset>0x2D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_IBUS0_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in L2-Cache due to bus0 accesses L2-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_IBUS1_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in L2-Cache due to bus1 accesses L2-Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_IBUS2_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_IBUS3_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_DBUS0_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in L2-Cache due to bus0 accesses L2-Cache.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_DBUS1_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in L2-Cache due to bus1 accesses L2-Cache.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_DBUS2_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_DBUS3_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
