espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>CACHE_L2_IBUS2_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_IBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-ICache2 accesses L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_IBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_IBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-ICache2 accessing L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_IBUS3_ACS_HIT_CNT</name>
          <description>L2-Cache bus3 Hit-Access Counter register</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_IBUS3_HIT_CNT</name>
              <description>The register records the number of hits when L1-ICache3 accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_IBUS3_ACS_MISS_CNT</name>
          <description>L2-Cache bus3 Miss-Access Counter register</description>
          <addressOffset>0x32C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_IBUS3_MISS_CNT</name>
              <description>The register records the number of missing when L1-ICache3 accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_IBUS3_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_IBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-ICache3 accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_IBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x334</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_IBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-ICache3 accessing L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS0_ACS_HIT_CNT</name>
          <description>L2-Cache bus0 Hit-Access Counter register</description>
          <addressOffset>0x338</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS0_HIT_CNT</name>
              <description>The register records the number of hits when L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS0_ACS_MISS_CNT</name>
          <description>L2-Cache bus0 Miss-Access Counter register</description>
          <addressOffset>0x33C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS0_MISS_CNT</name>
              <description>The register records the number of missing when L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS0_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus0 Conflict-Access Counter register</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS0_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-DCache accessing L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS0_ACS_NXTLVL_WR_CNT</name>
          <description>L2-Cache bus0 WB-Access Counter register</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS0_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS1_ACS_HIT_CNT</name>
          <description>L2-Cache bus1 Hit-Access Counter register</description>
          <addressOffset>0x34C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS1_HIT_CNT</name>
              <description>The register records the number of hits when L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS1_ACS_MISS_CNT</name>
          <description>L2-Cache bus1 Miss-Access Counter register</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS1_MISS_CNT</name>
              <description>The register records the number of missing when L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS1_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-DCache accessing L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS1_ACS_NXTLVL_WR_CNT</name>
          <description>L2-Cache bus1 WB-Access Counter register</description>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS1_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS2_ACS_HIT_CNT</name>
          <description>L2-Cache bus2 Hit-Access Counter register</description>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS2_HIT_CNT</name>
              <description>The register records the number of hits when L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS2_ACS_MISS_CNT</name>
          <description>L2-Cache bus2 Miss-Access Counter register</description>
          <addressOffset>0x364</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS2_MISS_CNT</name>
              <description>The register records the number of missing when L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS2_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-DCache accessing L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS2_ACS_NXTLVL_WR_CNT</name>
          <description>L2-Cache bus2 WB-Access Counter register</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS2_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS3_ACS_HIT_CNT</name>
          <description>L2-Cache bus3 Hit-Access Counter register</description>
          <addressOffset>0x374</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS3_HIT_CNT</name>
              <description>The register records the number of hits when L1-DCache accesses L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS3_ACS_MISS_CNT</name>
          <description>L2-Cache bus3 Miss-Access Counter register</description>
          <addressOffset>0x378</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS3_MISS_CNT</name>
              <description>The register records the number of missing when L1-DCache accesses L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS3_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x37C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-DCache accesses L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-DCache accessing L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_DBUS3_ACS_NXTLVL_WR_CNT</name>
          <description>L2-Cache bus3 WB-Access Counter register</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_DBUS3_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when L1-DCache accesses L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_ACS_FAIL_ID_ATTR</name>
          <description>L2-Cache Access Fail ID/attribution information register</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_FAIL_ID</name>
              <description>The register records the ID of fail-access when L1-Cache accesses L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when L1-Cache accesses L2-Cache due to cache accessing L1-Cache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_ACS_FAIL_ADDR</name>
          <description>L2-Cache Access Fail Address information register</description>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_FAIL_ADDR</name>
              <description>The register records the address of fail-access when L1-Cache accesses L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_SYNC_PRELOAD_INT_ENA</name>
          <description>L1-Cache Access Fail Interrupt enable register</description>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PLD_DONE_INT_ENA</name>
              <description>The bit is used to enable interrupt of L2-Cache preload-operation done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PLD_ERR_INT_ENA</name>
              <description>The bit is used to enable interrupt of L2-Cache preload-operation error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_SYNC_PRELOAD_INT_CLR</name>
          <description>Sync Preload operation Interrupt clear register</description>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PLD_DONE_INT_CLR</name>
              <description>The bit is used to clear interrupt that occurs only when L2-Cache preload-operation is done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PLD_ERR_INT_CLR</name>
              <description>The bit is used to clear interrupt of L2-Cache preload-operation error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_SYNC_PRELOAD_INT_RAW</name>
          <description>Sync Preload operation Interrupt raw register</description>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PLD_DONE_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L2-Cache preload-operation is done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PLD_ERR_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L2-Cache preload-operation error occurs.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_SYNC_PRELOAD_INT_ST</name>
          <description>L1-Cache Access Fail Interrupt status register</description>
          <addressOffset>0x39C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PLD_DONE_INT_ST</name>
              <description>The bit indicates the status of the interrupt that occurs only when L2-Cache preload-operation is done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_L2_CACHE_PLD_ERR_INT_ST</name>
              <description>The bit indicates the status of the interrupt of L2-Cache preload-operation error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_L2_CACHE_SYNC_PRELOAD_EXCEPTION</name>
          <description>Cache Sync/Preload Operation exception register</description>
          <addressOffset>0x3A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_L2_CACHE_PLD_ERR_CODE</name>
              <description>The value 2 is Only available which means preload size is error in L2-Cache.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
