espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>RD_REPEAT_DATA_ERR3</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION_ERR</name>
              <description>Represents the programming error of EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_EN_ERR</name>
              <description>Represents the programming error of EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM_ERR</name>
              <description>Represents the programming error of EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECOVERY_BOOTLOADER_FLASH_SECTOR_ERR</name>
              <description>Represents the programming error of EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA_ERR4</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RD_REPEAT_DATA4_ERR</name>
              <description>Represents the programming error of EFUSE_RD_REPEAT_DATA4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_RS_DATA_ERR0</name>
          <description>Represents rd_rs_data_err</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RD_MAC_SYS_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_mac_sys</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_MAC_SYS_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_mac_sys is reliable\\ 1: Means that programming rd_mac_sys failed and the number of error bytes is over 6.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_SYS_PART1_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_sys_part1_data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_SYS_PART1_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_sys_part1_data is reliable\\ 1: Means that programming rd_sys_part1_data failed and the number of error bytes is over 6.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_USR_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_usr_data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_USR_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_usr_data is reliable\\ 1: Means that programming rd_usr_data failed and the number of error bytes is over 6.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY0_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key0_data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY0_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key0_data is reliable\\ 1: Means that programming rd_key0_data failed and the number of error bytes is over 6.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY1_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key1_data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY1_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key1_data is reliable\\ 1: Means that programming rd_key1_data failed and the number of error bytes is over 6.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY2_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key2_data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY2_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key2_data is reliable\\ 1: Means that programming rd_key2_data failed and the number of error bytes is over 6.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY3_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key3_data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY3_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key3_data is reliable\\ 1: Means that programming rd_key3_data failed and the number of error bytes is over 6.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY4_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key4_data</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY4_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key4_data is reliable\\ 1: Means that programming rd_key4_data failed and the number of error bytes is over 6.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_RS_DATA_ERR1</name>
          <description>Represents rd_rs_data_err</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RD_KEY5_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key5_data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY5_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key5_data is reliable\\ 1: Means that programming rd_key5_data failed and the number of error bytes is over 6.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_SYS_PART2_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_sys_part2_data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_SYS_PART2_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_sys_part2_data is reliable\\ 1: Means that programming rd_sys_part2_data failed and the number of error bytes is over 6.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
