espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>APB2OTP_BLK8_W6</name>
          <description>eFuse apb2otp block8 data register6.</description>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W6</name>
              <description>Otp block8 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W7</name>
          <description>eFuse apb2otp block8 data register7.</description>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W7</name>
              <description>Otp block8 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W8</name>
          <description>eFuse apb2otp block8 data register8.</description>
          <addressOffset>0x69C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W8</name>
              <description>Otp block8 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W9</name>
          <description>eFuse apb2otp block8 data register9.</description>
          <addressOffset>0x6A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W9</name>
              <description>Otp block8 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W10</name>
          <description>eFuse apb2otp block8 data register10.</description>
          <addressOffset>0x6A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W10</name>
              <description>Otp block8 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W11</name>
          <description>eFuse apb2otp block8 data register11.</description>
          <addressOffset>0x6A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W11</name>
              <description>Otp block8 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W1</name>
          <description>eFuse apb2otp block9 data register1.</description>
          <addressOffset>0x6AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W1</name>
              <description>Otp block9 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W2</name>
          <description>eFuse apb2otp block9 data register2.</description>
          <addressOffset>0x6B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W2</name>
              <description>Otp block9 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W3</name>
          <description>eFuse apb2otp block9 data register3.</description>
          <addressOffset>0x6B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W3</name>
              <description>Otp block9 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W4</name>
          <description>eFuse apb2otp block9 data register4.</description>
          <addressOffset>0x6B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W4</name>
              <description>Otp block9 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W5</name>
          <description>eFuse apb2otp block9 data register5.</description>
          <addressOffset>0x6BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W5</name>
              <description>Otp block9 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W6</name>
          <description>eFuse apb2otp block9 data register6.</description>
          <addressOffset>0x6C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W6</name>
              <description>Otp block9 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W7</name>
          <description>eFuse apb2otp block9 data register7.</description>
          <addressOffset>0x6C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W7</name>
              <description>Otp block9 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W8</name>
          <description>eFuse apb2otp block9 data register8.</description>
          <addressOffset>0x6C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W8</name>
              <description>Otp block9 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W9</name>
          <description>eFuse apb2otp block9 data register9.</description>
          <addressOffset>0x6CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W9</name>
              <description>Otp block9 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W10</name>
          <description>eFuse apb2otp block9 data register10.</description>
          <addressOffset>0x6D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W10</name>
              <description>Otp block9 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W11</name>
          <description>eFuse apb2otp block9 data register11.</description>
          <addressOffset>0x6D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W11</name>
              <description>Otp block9 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W1</name>
          <description>eFuse apb2otp block10 data register1.</description>
          <addressOffset>0x6D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W1</name>
              <description>Otp block10 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W2</name>
          <description>eFuse apb2otp block10 data register2.</description>
          <addressOffset>0x6DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W2</name>
              <description>Otp block10 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W3</name>
          <description>eFuse apb2otp block10 data register3.</description>
          <addressOffset>0x6E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W3</name>
              <description>Otp block10 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W4</name>
          <description>eFuse apb2otp block10 data register4.</description>
          <addressOffset>0x6E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W4</name>
              <description>Otp block10 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W5</name>
          <description>eFuse apb2otp block10 data register5.</description>
          <addressOffset>0x6E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W5</name>
              <description>Otp block10 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W6</name>
          <description>eFuse apb2otp block10 data register6.</description>
          <addressOffset>0x6EC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W6</name>
              <description>Otp block10 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W7</name>
          <description>eFuse apb2otp block10 data register7.</description>
          <addressOffset>0x6F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W7</name>
              <description>Otp block10 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W8</name>
          <description>eFuse apb2otp block10 data register8.</description>
          <addressOffset>0x6F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W8</name>
              <description>Otp block10 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W9</name>
          <description>eFuse apb2otp block10 data register9.</description>
          <addressOffset>0x6F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W9</name>
              <description>Otp block10 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W10</name>
          <description>eFuse apb2otp block10 data register10.</description>
          <addressOffset>0x6FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W10</name>
              <description>Otp block10 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W11</name>
          <description>eFuse apb2otp block10 data register11.</description>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W11</name>
              <description>Otp block10 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_EN</name>
          <description>eFuse apb2otp enable configuration register.</description>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_APB2OTP_EN</name>
              <description>Apb2otp mode enable signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
