espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x80</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT_CORE0</name>
      <description>Interrupt Controller (Core 0)</description>
      <groupName>INTERRUPT_CORE0</groupName>
      <baseAddress>0x60010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x130</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WIFI_MAC</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>WIFI_MAC_NMI</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>WIFI_PWR</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>WIFI_BB</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>BT_MAC</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>BT_BB</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>BT_BB_NMI</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>LP_TIMER</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>COEX</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>BLE_TIMER</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>BLE_SEC</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>ZB_MAC</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR0</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR1</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR2</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR3</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>CACHE</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>CPU_PERI_TIMEOUT</name>
        <value>26</value>
      </interrupt>
      <registers>
        <register>
          <dim>66</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CORE_0_INTR_MAP%s</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PASS_IN_SEC</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>CORE_0_INTR_STATUS%s</name>
          <description>Represents the status of the interrupt sources. Each bit corresponds to one interrupt source</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_STATUS_0</name>
              <description>Represents the status of the interrupt sources within interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
0:The corresponding interrupt source triggered an interrupt
1:No interrupt triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_PASS_IN_SEC_STATUS_0</name>
          <description>PASS_IN_SEC status register for interrupt sources 0 ~ 31</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_0</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources within interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_PASS_IN_SEC_STATUS_1</name>
          <description>PASS_IN_SEC status register for interrupt sources 32 ~ 63</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_1</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources within interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_PASS_IN_SEC_STATUS_2</name>
          <description>PASS_IN_SEC status register for interrupt sources 64 ~ 65</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_2</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources with interrupt-index-range 64 ~ 65. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIG_IDX_ASSERT_IN_SEC</name>
          <description>reserved</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SIG_IDX_ASSERT_IN_SEC</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURE_STATUS</name>
          <description>reserved</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SECURE_STATUS</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Interrupt clock gating configure register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_CLK_EN</name>
              <description>Interrupt clock gating configure register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
