espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>EVT_TASK_EN0</name>
          <description>Ledc event task enable bit register0.</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVT_DUTY_CHNG_END_CH0_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH0 event.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH1_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH1 event.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH2_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH2 event.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH3_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH3 event.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH4_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH4 event.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH5_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH5 event.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH0_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH0 event.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH1_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH1 event.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH2_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH2 event.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH3_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH3 event.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH4_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH4 event.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH5_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH5 event.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER0_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER0 event.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER1_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER1 event.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER2_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER2 event.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER3_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER3 event.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME0_CMP_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIMER0_CMP event.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME1_CMP_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIMER1_CMP event.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME2_CMP_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIMER2_CMP event.\\0: Disable\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME3_CMP_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIMER3_CMP event.\\0: Disable\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH0_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH0 task.\\0: Disable\\1: Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH1_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH1 task.\\0: Disable\\1: Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH2_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH2 task.\\0: Disable\\1: Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH3_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH3 task.\\0: Disable\\1: Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH4_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH4 task.\\0: Disable\\1: Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH5_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH5 task.\\0: Disable\\1: Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_TASK_EN1</name>
          <description>Ledc event task enable bit register1.</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASK_TIMER0_RES_UPDATE_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER0_RES_UPDATE task.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_RES_UPDATE_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER1_RES_UPDATE task.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_RES_UPDATE_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER2_RES_UPDATE task.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_RES_UPDATE_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER3_RES_UPDATE task.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_CAP_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER0_CAP task.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_CAP_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER1_CAP task.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_CAP_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER2_CAP task.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_CAP_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER3_CAP task.\\0: Disable\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH0_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_SIG_OUT_DIS_CH0 task.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH1_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_SIG_OUT_DIS_CH1 task.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH2_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_SIG_OUT_DIS_CH2 task.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH3_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_SIG_OUT_DIS_CH3 task.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH4_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_SIG_OUT_DIS_CH4 task.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH5_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_SIG_OUT_DIS_CH5 task.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH0_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_OVF_CNT_RST_CH0 task.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH1_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_OVF_CNT_RST_CH1 task.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH2_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_OVF_CNT_RST_CH2 task.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH3_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_OVF_CNT_RST_CH3 task.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH4_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_OVF_CNT_RST_CH4 task.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH5_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_OVF_CNT_RST_CH5 task.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_RST_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER0_RST task.\\0: Disable\\1: Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_RST_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER1_RST task.\\0: Disable\\1: Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_RST_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER2_RST task.\\0: Disable\\1: Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_RST_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER3_RST task.\\0: Disable\\1: Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_PAUSE_RESUME_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER0_PAUSE and LEDC_TASK_TIMER0 _RESUME task.\\0: Disable\\1: Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_PAUSE_RESUME_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER1_PAUSE and LEDC_TASK_TIMER1 _RESUME task.\\0: Disable\\1: Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_PAUSE_RESUME_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER2_PAUSE and LEDC_TASK_TIMER2 _RESUME task.\\0: Disable\\1: Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_PAUSE_RESUME_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_TIMER3_PAUSE and LEDC_TASK_TIMER3 _RESUME task.\\0: Disable\\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
