espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>I2S_TX_CLKM_DIV_CONF</name>
          <description>I2S_TX_CLKM_DIV configuration register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>I2S_TX_CLKM_DIV_Z</name>
              <description>For b &lt;= a/2, the value of I2S_TX_CLKM_DIV_Z is b. For b &gt; a/2, the value of I2S_TX_CLKM_DIV_Z is (a-b).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_TX_CLKM_DIV_Y</name>
              <description>For b &lt;= a/2, the value of I2S_TX_CLKM_DIV_Y is (a%b) . For b &gt; a/2, the value of I2S_TX_CLKM_DIV_Y is (a%(a-b)).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_TX_CLKM_DIV_X</name>
              <description>For b &lt;= a/2, the value of I2S_TX_CLKM_DIV_X is (a/b) - 1. For b &gt; a/2, the value of I2S_TX_CLKM_DIV_X is (a/(a-b)) - 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_TX_CLKM_DIV_YN1</name>
              <description>For b &lt;= a/2, the value of I2S_TX_CLKM_DIV_YN1 is 0 . For b &gt; a/2, the value of I2S_TX_CLKM_DIV_YN1 is 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_RX_CLKM_CONF</name>
          <description>I2S_RX_CLKM configuration register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00402000</resetValue>
          <fields>
            <field>
              <name>I2S_RX_CLKM_DIV_NUM</name>
              <description>Integral I2S clock divider value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_SEL</name>
              <description>Configures the clock source of I2S RX.\\
0 (default): XTAL_CLK\\
1: PLL_F120M_CLK\\
2: PLL_F160M_CLK\\
3: I2S_MCLK_in\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_EN</name>
              <description>Set 1 to enable i2s_rx function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_MCLK_SEL</name>
              <description>Configures to select master clock.\\
0 (default): I2S_TX_CLK\\
1: I2S_RX_CLK\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_RX_CLKM_DIV_CONF</name>
          <description>I2S_RX_CLKM_DIV configuration register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>I2S_RX_CLKM_DIV_Z</name>
              <description>For b &lt;= a/2, the value of I2S_RX_CLKM_DIV_Z is b. For b &gt; a/2, the value of I2S_RX_CLKM_DIV_Z is (a-b).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_DIV_Y</name>
              <description>For b &lt;= a/2, the value of I2S_RX_CLKM_DIV_Y is (a%b) . For b &gt; a/2, the value of I2S_RX_CLKM_DIV_Y is (a%(a-b)).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_DIV_X</name>
              <description>For b &lt;= a/2, the value of I2S_RX_CLKM_DIV_X is (a/b) - 1. For b &gt; a/2, the value of I2S_RX_CLKM_DIV_X is (a/(a-b)) - 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_DIV_YN1</name>
              <description>For b &lt;= a/2, the value of I2S_RX_CLKM_DIV_YN1 is 0 . For b &gt; a/2, the value of I2S_RX_CLKM_DIV_YN1 is 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARADC_CONF</name>
          <description>SARADC configuration register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>SARADC_CLK_EN</name>
              <description>no use</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_RST_EN</name>
              <description>Set 1 to reset function_register of saradc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_REG_CLK_EN</name>
              <description>Set 1 to enable saradc apb clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_REG_RST_EN</name>
              <description>Set 1 to reset apb_register of saradc module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARADC_CLKM_CONF</name>
          <description>SARADC_CLKM configuration register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00404000</resetValue>
          <fields>
            <field>
              <name>SARADC_CLKM_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_DIV_B</name>
              <description>The numerator of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_SEL</name>
              <description>Configures the clock source of SAR ADC.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F80M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_EN</name>
              <description>Set 1 to enable saradc function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSENS_CLK_CONF</name>
          <description>TSENS_CLK configuration register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>TSENS_CLK_SEL</name>
              <description>Configures the clock source of the temperature sensor.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLK_EN</name>
              <description>Set 1 to enable tsens clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_RST_EN</name>
              <description>Set 1 to reset tsens module</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DEVICE_CONF</name>
          <description>USB_DEVICE configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>USB_DEVICE_CLK_EN</name>
              <description>Set 1 to enable usb_device clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVICE_RST_EN</name>
              <description>Set 1 to reset usb_device module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVICE_READY</name>
              <description>Query this field after reset usb_device module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMTX_CONF</name>
          <description>INTMTX configuration register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>INTMTX_CLK_EN</name>
              <description>Set 1 to enable intmtx clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_RST_EN</name>
              <description>Set 1 to reset intmtx module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_READY</name>
              <description>Query this field after reset intmtx module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_MONITOR_CONF</name>
          <description>PVT_MONITOR configuration register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000029</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_CLK_EN</name>
              <description>Set 1 to enable apb clock of pvt module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_RST_EN</name>
              <description>Set 1 to reset all pvt monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE2_CLK_EN</name>
              <description>Set 1 to enable function clock of cpu pvt module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE2_RST_EN</name>
              <description>Set 1 to reset cpu pvt monitor site</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE3_CLK_EN</name>
              <description>Set 1 to enable function clock of modem pvt module</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_MONITOR_FUNC_CLK_CONF</name>
          <description>PVT_MONITOR function clock configuration register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pvt_monitor function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_SEL</name>
              <description>Configures the clock source of PVT MONITER.\\
0 (default): XTAL_CLK\\
1: PLL_F160M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_EN</name>
              <description>Set 1 to enable source clock of pvt sitex</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDMA_CONF</name>
          <description>GDMA configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>GDMA_CLK_EN</name>
              <description>Set 1 to enable gdma clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDMA_RST_EN</name>
              <description>Set 1 to reset gdma module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CONF</name>
          <description>SPI2 configuration register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>SPI2_CLK_EN</name>
              <description>Set 1 to enable spi2 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_RST_EN</name>
              <description>Set 1 to reset spi2 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_READY</name>
              <description>Query this field after reset spi2 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CLKM_CONF</name>
          <description>SPI2_CLKM configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>SPI2_CLKM_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the spi2_mst clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_CLKM_SEL</name>
              <description>Configures the clock source of SPI2.\\
0 (default): XTAL_CLK\\
1: PLL_F160M_CLK\\
2: RC_FAST_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_CLKM_EN</name>
              <description>Set 1 to enable spi2 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CONF</name>
          <description>AES configuration register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>AES_CLK_EN</name>
              <description>Set 1 to enable aes clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_RST_EN</name>
              <description>Set 1 to reset aes module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_READY</name>
              <description>Query this field after reset aes module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_CONF</name>
          <description>SHA configuration register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>SHA_CLK_EN</name>
              <description>Set 1 to enable sha clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_RST_EN</name>
              <description>Set 1 to reset sha module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_READY</name>
              <description>Query this field after reset sha module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_CONF</name>
          <description>RSA configuration register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>RSA_CLK_EN</name>
              <description>Set 1 to enable rsa clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_RST_EN</name>
              <description>Set 1 to reset rsa module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_READY</name>
              <description>Query this field after reset rsa module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_PD_CTRL</name>
          <description>RSA power control register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>RSA_MEM_PD</name>
              <description>Set this bit to power down rsa internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_FORCE_PU</name>
              <description>Set this bit to force power up rsa internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_FORCE_PD</name>
              <description>Set this bit to force power down rsa internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CONF</name>
          <description>ECC configuration register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>ECC_CLK_EN</name>
              <description>Set 1 to enable ecc clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_RST_EN</name>
              <description>Set 1 to reset ecc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_READY</name>
              <description>Query this field after reset ecc module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
