espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>COMB_PD_SITE0_UNIT3_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT0_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT1_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT2_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT3_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT0_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT1_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT2_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT3_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT0_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT1_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT2_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT3_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT0_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
