espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>H_MEM[%s]</name>
          <description>Sha H memory which contains intermediate hash or finial hash.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>M_MEM[%s]</name>
          <description>Sha M memory which contains message.</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>_3_MODE</name>
          <description>Initial configuration register 0.</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_MODE</name>
              <description>Sha3 mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CLEAN_M</name>
          <description>Initial configuration register 1.</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_CLEAN_M</name>
              <description>Clean Message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DMA_BLOCK_NUM</name>
          <description>DMA configuration register 0.</description>
          <addressOffset>0x80C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_DMA_BLOCK_NUM</name>
              <description>DMA-SHA3 block number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_START</name>
          <description>Typical SHA3 configuration register 0.</description>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_START</name>
              <description>Start typical sha3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CONTINUE</name>
          <description>Typical SHA3 configuration register 1.</description>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_CONTINUE</name>
              <description>Continue typical sha3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_BUSY</name>
          <description>Busy register.</description>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_BUSY</name>
              <description>Sha3 busy state. 1'b0: idle. 1'b1: busy.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DMA_START</name>
          <description>DMA configuration register 1.</description>
          <addressOffset>0x81C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_DMA_START</name>
              <description>Start dma-sha3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DMA_CONTINUE</name>
          <description>DMA configuration register 2.</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_DMA_CONTINUE</name>
              <description>Continue dma-sha3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CLEAR_INT</name>
          <description>Interrupt clear register.</description>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_CLEAR_INT</name>
              <description>Clear sha3 interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_INT_ENA</name>
          <description>Interrupt enable register.</description>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>_3_INT_ENA</name>
              <description>Sha3 interrupt enable register. 1'b0: disable(default). 1'b1:enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_SHAKE_LENGTH</name>
          <description>DMA configuration register 3.</description>
          <addressOffset>0x82C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000032</resetValue>
          <fields>
            <field>
              <name>_3_SHAKE_LENGTH</name>
              <description>SHAKE output hash word length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>200</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>_3_M_OUT_MEM[%s]</name>
          <description>Sha3 hash reg which contains intermediate hash or finial hash.</description>
          <addressOffset>0x900</addressOffset>
          <size>0x8</size>
        </register>
        <register>
          <dim>200</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>_3_M_MEM[%s]</name>
          <description>Sha3 message reg which contains message.</description>
          <addressOffset>0xA00</addressOffset>
          <size>0x8</size>
        </register>
