espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SOC_ETM</name>
      <description>Event Task Matrix</description>
      <groupName>SOC_ETM</groupName>
      <baseAddress>0x60013000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1F8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CH_ENA_AD0</name>
          <description>Channel enable status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>CH_ENA%s</name>
              <description>Represents ch%s enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD0_SET</name>
          <description>Channel enable set register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>CH_SET%s</name>
              <description>Configures whether or not to enable ch%s.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD0_CLR</name>
          <description>Channel enable clear register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>CH_CLR%s</name>
              <description>Configures whether or not to clear ch%s enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD1</name>
          <description>Channel enable status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>18</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>32-49</dimIndex>
              <name>CH_ENA%s</name>
              <description>Represents ch%s enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD1_SET</name>
          <description>Channel enable set register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>18</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>32-49</dimIndex>
              <name>CH_SET%s</name>
              <description>Configures whether or not to enable ch%s.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD1_CLR</name>
          <description>Channel enable clear register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>18</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>32-49</dimIndex>
              <name>CH_CLR%s</name>
              <description>Configures whether or not to clear ch%s enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>50</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-49</dimIndex>
          <name>CH%s</name>
          <description>Cluster CH%s, containing CH*_EVT_ID, CH*_TASK_ID</description>
          <addressOffset>0x18</addressOffset>
          <register>
            <name>EVT_ID</name>
            <description>Channel0 event id register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EVT_ID</name>
                <description>Configures ch0_evt_id</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TASK_ID</name>
            <description>Channel0 task id register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TASK_ID</name>
                <description>Configures ch0_task_id</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>EVT_ST0</name>
          <description>Events trigger status register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPIO_EVT_CH0_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH0_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH0_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_POS0_ST</name>
              <description>Represents GPIO_evt_zero_det_pos0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_NEG0_ST</name>
              <description>Represents GPIO_evt_zero_det_neg0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_POS1_ST</name>
              <description>Represents GPIO_evt_zero_det_pos1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_NEG1_ST</name>
              <description>Represents GPIO_evt_zero_det_neg1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH0_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH1_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH2_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH3_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
