espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>EVT_ST3_CLR</name>
          <description>Events trigger status clear register</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GDMA_AHB_EVT_IN_FIFO_FULL_CH1_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_in_fifo_full_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_IN_FIFO_FULL_CH2_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_in_fifo_full_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_DONE_CH0_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_done_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_DONE_CH1_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_done_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_DONE_CH2_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_done_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_EOF_CH0_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_eof_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_EOF_CH1_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_eof_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_EOF_CH2_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_eof_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_TOTAL_EOF_CH0_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_total_eof_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_TOTAL_EOF_CH1_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_total_eof_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_TOTAL_EOF_CH2_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_total_eof_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_fifo_empty_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_fifo_empty_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_fifo_empty_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_FIFO_FULL_CH0_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_fifo_full_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_FIFO_FULL_CH1_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_fifo_full_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_AHB_EVT_OUT_FIFO_FULL_CH2_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_AHB_evt_out_fifo_full_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_EVT_SLEEP_WEEKUP_ST_CLR</name>
              <description>Configures whether or not to clear PMU_evt_sleep_weekup trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_ST0</name>
          <description>Tasks trigger status register</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPIO_TASK_CH0_SET_ST</name>
              <description>Represents GPIO_task_ch0_set trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH1_SET_ST</name>
              <description>Represents GPIO_task_ch1_set trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH2_SET_ST</name>
              <description>Represents GPIO_task_ch2_set trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH3_SET_ST</name>
              <description>Represents GPIO_task_ch3_set trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH4_SET_ST</name>
              <description>Represents GPIO_task_ch4_set trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH5_SET_ST</name>
              <description>Represents GPIO_task_ch5_set trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH6_SET_ST</name>
              <description>Represents GPIO_task_ch6_set trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH7_SET_ST</name>
              <description>Represents GPIO_task_ch7_set trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH0_CLEAR_ST</name>
              <description>Represents GPIO_task_ch0_clear trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH1_CLEAR_ST</name>
              <description>Represents GPIO_task_ch1_clear trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH2_CLEAR_ST</name>
              <description>Represents GPIO_task_ch2_clear trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH3_CLEAR_ST</name>
              <description>Represents GPIO_task_ch3_clear trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH4_CLEAR_ST</name>
              <description>Represents GPIO_task_ch4_clear trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH5_CLEAR_ST</name>
              <description>Represents GPIO_task_ch5_clear trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH6_CLEAR_ST</name>
              <description>Represents GPIO_task_ch6_clear trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH7_CLEAR_ST</name>
              <description>Represents GPIO_task_ch7_clear trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH0_TOGGLE_ST</name>
              <description>Represents GPIO_task_ch0_toggle trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH1_TOGGLE_ST</name>
              <description>Represents GPIO_task_ch1_toggle trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH2_TOGGLE_ST</name>
              <description>Represents GPIO_task_ch2_toggle trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH3_TOGGLE_ST</name>
              <description>Represents GPIO_task_ch3_toggle trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH4_TOGGLE_ST</name>
              <description>Represents GPIO_task_ch4_toggle trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH5_TOGGLE_ST</name>
              <description>Represents GPIO_task_ch5_toggle trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH6_TOGGLE_ST</name>
              <description>Represents GPIO_task_ch6_toggle trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_TASK_CH7_TOGGLE_ST</name>
              <description>Represents GPIO_task_ch7_toggle trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_TASK_TIMER0_RES_UPDATE_ST</name>
              <description>Represents LEDC_task_timer0_res_update trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_TASK_TIMER1_RES_UPDATE_ST</name>
              <description>Represents LEDC_task_timer1_res_update trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_TASK_TIMER2_RES_UPDATE_ST</name>
              <description>Represents LEDC_task_timer2_res_update trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_TASK_TIMER3_RES_UPDATE_ST</name>
              <description>Represents LEDC_task_timer3_res_update trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_TASK_DUTY_SCALE_UPDATE_CH0_ST</name>
              <description>Represents LEDC_task_duty_scale_update_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_TASK_DUTY_SCALE_UPDATE_CH1_ST</name>
              <description>Represents LEDC_task_duty_scale_update_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_TASK_DUTY_SCALE_UPDATE_CH2_ST</name>
              <description>Represents LEDC_task_duty_scale_update_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_TASK_DUTY_SCALE_UPDATE_CH3_ST</name>
              <description>Represents LEDC_task_duty_scale_update_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
