espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>SLC0_TX_SHAREMEM_START</name>
          <description>SLC0 AHB TX start address range</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_SLC0_TX_SHAREMEM_START_ADDR</name>
              <description>Configures SLC0 host to slave channel AHB start address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0_TX_SHAREMEM_END</name>
          <description>SLC0 AHB TX end address range</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_SLC0_TX_SHAREMEM_END_ADDR</name>
              <description>Configures SLC0 host to slave channel AHB end address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0_RX_SHAREMEM_START</name>
          <description>SLC0 AHB RX start address range</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR</name>
              <description>Configures SLC0 slave to host channel AHB start address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0_RX_SHAREMEM_END</name>
          <description>SLC0 AHB RX end address range</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_SLC0_RX_SHAREMEM_END_ADDR</name>
              <description>Configures SLC0 slave to host channel AHB end address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1_TX_SHAREMEM_START</name>
          <description>SLC1 AHB TX start address range</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR</name>
              <description>Configures SLC0 slave to host channel AHB start address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1_TX_SHAREMEM_END</name>
          <description>SLC1 AHB TX end address range</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_SLC1_TX_SHAREMEM_END_ADDR</name>
              <description>Configures SLC1 host to slave channel AHB end address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1_RX_SHAREMEM_START</name>
          <description>SLC1 AHB RX start address range</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_SLC1_RX_SHAREMEM_START_ADDR</name>
              <description>Configures SLC1 slave to host channel AHB start address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1_RX_SHAREMEM_END</name>
          <description>SLC1 AHB RX end address range</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_SLC1_RX_SHAREMEM_END_ADDR</name>
              <description>Configures SLC1 slave to host channel AHB end address boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC_BURST_LEN</name>
          <description>DMA AHB burst type configuration</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_TXDATA_BURST_LEN</name>
              <description>Configures SLC0 host to slave channel AHB burst type.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RXDATA_BURST_LEN</name>
              <description>Configures SLC0 slave to host channel AHB burst type.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TXDATA_BURST_LEN</name>
              <description>Configures SLC1 host to slave channel AHB burst type.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RXDATA_BURST_LEN</name>
              <description>Configures SLC1 slave to host channel AHB burst type.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0INT_RAW</name>
          <description>SLC0 to slave raw interrupt status</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <name>SDIO_SLC_FRHOST_BIT%s_INT_RAW</name>
              <description>The raw interrupt status of SLC_FRHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_START_INT_RAW</name>
              <description>The raw interrupt status of SLC0_RX_START_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_START_INT_RAW</name>
              <description>The raw interrupt status of SLC0_TX_START_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_UDF_INT_RAW</name>
              <description>The raw interrupt status of SLC0_RX_UDF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_OVF_INT_RAW</name>
              <description>The raw interrupt status of SLC0_TX_OVF_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_DONE_INT_RAW</name>
              <description>The raw interrupt status of SLC0_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_SUC_EOF_INT_RAW</name>
              <description>The raw interrupt status of SLC0_TX_SUC_EOF_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_DONE_INT_RAW</name>
              <description>The raw interrupt status of SLC0_RX_DONE_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_EOF_INT_RAW</name>
              <description>The raw interrupt status of SLC0_RX_EOF_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_DSCR_ERR_INT_RAW</name>
              <description>The raw interrupt status of SLC0_TX_DSCR_ERR_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_DSCR_ERR_INT_RAW</name>
              <description>The raw interrupt status of SLC0_RX_DSCR_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0INT_ST</name>
          <description>SLC0 to slave masked interrupt status</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <name>SDIO_SLC_FRHOST_BIT%s_INT_ST</name>
              <description>The masked interrupt status of SLC_FRHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_START_INT_ST</name>
              <description>The masked interrupt status of SLC0_RX_START_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_START_INT_ST</name>
              <description>The masked interrupt status of SLC0_TX_START_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_UDF_INT_ST</name>
              <description>The masked interrupt status of SLC0_RX_UDF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_OVF_INT_ST</name>
              <description>The masked interrupt status of SLC0_TX_OVF_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_DONE_INT_ST</name>
              <description>The masked interrupt status of SLC0_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_SUC_EOF_INT_ST</name>
              <description>The masked interrupt status of SLC0_TX_SUC_EOF_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_DONE_INT_ST</name>
              <description>The masked interrupt status of SLC0_RX_DONE_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_EOF_INT_ST</name>
              <description>The masked interrupt status of SLC0_RX_EOF_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_DSCR_ERR_INT_ST</name>
              <description>The masked interrupt status of SLC0_TX_DSCR_ERR_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_DSCR_ERR_INT_ST</name>
              <description>The masked interrupt status of SLC0_RX_DSCR_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0INT_ENA</name>
          <description>SLC0 to slave interrupt enable</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <name>SDIO_SLC_FRHOST_BIT%s_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC_FRHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_ENAART_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_RX_ENAART_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_ENAART_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_TX_ENAART_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_UDF_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_RX_UDF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_OVF_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_TX_OVF_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_DONE_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_SUC_EOF_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_TX_SUC_EOF_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_DONE_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_RX_DONE_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_EOF_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_RX_EOF_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_DSCR_ERR_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_TX_DSCR_ERR_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_DSCR_ERR_INT_ENA</name>
              <description>Write 1 to enable interrupt SLC0_RX_DSCR_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0INT_CLR</name>
          <description>SLC0 to slave interrupt clear</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <name>SDIO_SLC_FRHOST_BIT%s_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC_FRHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_CLRART_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_RX_CLRART_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_CLRART_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_TX_CLRART_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_UDF_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_RX_UDF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_OVF_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_TX_OVF_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_DONE_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_SUC_EOF_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_TX_SUC_EOF_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_DONE_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_RX_DONE_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_EOF_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_RX_EOF_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_DSCR_ERR_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_TX_DSCR_ERR_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_DSCR_ERR_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC0_RX_DSCR_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1INT_RAW</name>
          <description>SLC1 to slave raw interrupt status</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <name>SDIO_SLC_FRHOST_BIT%s_INT_RAW</name>
              <description>The raw interrupt status of SLC_FRHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_START_INT_RAW</name>
              <description>The raw interrupt status of SLC1_RX_START_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_START_INT_RAW</name>
              <description>The raw interrupt status of SLC1_TX_START_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_UDF_INT_RAW</name>
              <description>The raw interrupt status of SLC1_RX_UDF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_OVF_INT_RAW</name>
              <description>The raw interrupt status of SLC1_TX_OVF_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_DONE_INT_RAW</name>
              <description>The raw interrupt status of SLC1_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_SUC_EOF_INT_RAW</name>
              <description>The raw interrupt status of SLC1_TX_SUC_EOF_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_DONE_INT_RAW</name>
              <description>The raw interrupt status of SLC1_RX_DONE_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_EOF_INT_RAW</name>
              <description>The raw interrupt status of SLC1_RX_EOF_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_DSCR_ERR_INT_RAW</name>
              <description>The raw interrupt status of SLC1_TX_DSCR_ERR_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_DSCR_ERR_INT_RAW</name>
              <description>The raw interrupt status of SLC1_RX_DSCR_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
