espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>SLC1INT_CLR</name>
          <description>SLC1 to slave interrupt clear</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <name>SDIO_SLC_FRHOST_BIT%s_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC_FRHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_CLRART_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_RX_CLRART_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_CLRART_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_TX_CLRART_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_UDF_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_RX_UDF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_OVF_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_TX_OVF_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_DONE_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_SUC_EOF_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_TX_SUC_EOF_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_DONE_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_RX_DONE_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_EOF_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_RX_EOF_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_DSCR_ERR_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_TX_DSCR_ERR_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_DSCR_ERR_INT_CLR</name>
              <description>Write 1 to clear interrupt SLC1_RX_DSCR_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLCINTVEC_TOHOST</name>
          <description>Slave to host interrupt vector set</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_TOHOST_INTVEC</name>
              <description>The interrupt set bit of SLCHOST_SLC0_TOHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TOHOST_INTVEC</name>
              <description>The interrupt set bit of SLCHOST_SLC1_TOHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1INT_ST1</name>
          <description>SLC1 to slave masked interrupt status</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <name>SDIO_SLC_FRHOST_BIT%s_INT_ST1</name>
              <description>The masked interrupt status of SLC_FRHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_START_INT_ST1</name>
              <description>The masked interrupt status of SLC1_RX_START_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_START_INT_ST1</name>
              <description>The masked interrupt status of SLC1_TX_START_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_UDF_INT_ST1</name>
              <description>The masked interrupt status of SLC1_RX_UDF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_OVF_INT_ST1</name>
              <description>The masked interrupt status of SLC1_TX_OVF_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_DONE_INT_ST1</name>
              <description>The masked interrupt status of SLC1_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_SUC_EOF_INT_ST1</name>
              <description>The masked interrupt status of SLC1_TX_SUC_EOF_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_DONE_INT_ST1</name>
              <description>The masked interrupt status of SLC1_RX_DONE_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_EOF_INT_ST1</name>
              <description>The masked interrupt status of SLC1_RX_EOF_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_DSCR_ERR_INT_ST1</name>
              <description>The masked interrupt status of SLC1_TX_DSCR_ERR_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_DSCR_ERR_INT_ST1</name>
              <description>The masked interrupt status of SLC1_RX_DSCR_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1INT_ENA1</name>
          <description>SLC1 to slave interrupt enable</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <name>SDIO_SLC_FRHOST_BIT%s_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC_FRHOST_BITn_INT (n: 0-7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_ENAART_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_RX_ENAART_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_ENAART_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_TX_ENAART_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_UDF_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_RX_UDF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_OVF_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_TX_OVF_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_DONE_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_SUC_EOF_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_TX_SUC_EOF_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_DONE_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_RX_DONE_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_EOF_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_RX_EOF_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_DSCR_ERR_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_TX_DSCR_ERR_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_DSCR_ERR_INT_ENA1</name>
              <description>Write 1 to enable interrupt SLC1_RX_DSCR_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0_LENGTH</name>
          <description>Length of transmitting packets</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDIO_SLC0_LEN</name>
              <description>Represents the accumulated length of data that the slave wants to send.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
