espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>NAND_FLASH_CFG_DATA0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NAND_FLASH_CFG_DATA0</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_CFG_DATA1</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NAND_FLASH_CFG_DATA1</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NAND_FLASH_CFG_DATA2</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_CFG_DATA3</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NAND_FLASH_CFG_DATA2</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NAND_FLASH_CFG_DATA4</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_CFG_DATA5</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NAND_FLASH_CMD_LUT0</name>
          <description>MSPI NAND FLASH CMD LUT control register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NAND_FLASH_LUT_CMD_VALUE0</name>
              <description>MSPI NAND FLASH config cmd value at cmd lut address 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_LUT_SFSM_ST_EN0</name>
              <description>MSPI NAND FLASH config sfsm_st_en at cmd lut address 0.[3]-ADDR period enable; [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_LUT_CMD_LEN0</name>
              <description>MSPI NAND FLASH config cmd length at cmd lut address 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_LUT_ADDR_LEN0</name>
              <description>MSPI NAND FLASH config address length at cmd lut address 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_LUT_DATA_LEN0</name>
              <description>MSPI NAND FLASH config data length at cmd lut address 0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_LUT_BUS_EN0</name>
              <description>MSPI NAND FLASH config spi_bus_en at cmd lut address 0,SPI could use DUAL/QUAD mode while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT0_REG's field. The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NAND_FLASH_SPI_SEQ0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NAND_FLASH_SEQ_TAIL_FLG0</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_SR_CHK_EN0</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_DIN_INDEX0</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 0.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_ADDR_INDEX0</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 0.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_REQ_OR_CFG0</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAND_FLASH_CMD_INDEX0</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_PLAIN_BASE</name>
          <description>The base address of the memory that stores plaintext in Manual Encryption</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_PLAIN</name>
              <description>This field is only used to generate include file in c case. This field is useless. Please do not use this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_LINESIZE</name>
          <description>Manual Encryption Line-Size register</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_LINESIZE</name>
              <description>This bits stores the line-size parameter which will be used in manual encryption calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1: 32-bytes, 2: 64-bytes, 3:reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_DESTINATION</name>
          <description>Manual Encryption destination register</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_DESTINATION</name>
              <description>This bit stores the destination parameter which will be used in manual encryption calculation. 0: flash(default), 1: psram(reserved). Only default value can be used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_PHYSICAL_ADDRESS</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_PHYSICAL_ADDRESS</name>
              <description>This bits stores the physical-address parameter which will be used in manual encryption calculation. This value should aligned with byte number decided by line-size parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_TRIGGER</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x34C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_TRIGGER</name>
              <description>Set this bit to trigger the process of manual encryption calculation. This action should only be asserted when manual encryption status is 0. After this action, manual encryption status becomes 1. After calculation is done, manual encryption status becomes 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_RELEASE</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_RELEASE</name>
              <description>Set this bit to release encrypted result to mspi. This action should only be asserted when manual encryption status is 2. After this action, manual encryption status will become 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_DESTROY</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_DESTROY</name>
              <description>Set this bit to destroy encrypted result. This action should be asserted only when manual encryption status is 3. After this action, manual encryption status will become 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTS_STATE</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_STATE</name>
              <description>This bits stores the status of manual encryption. 0: idle, 1: busy of encryption calculation, 2: encryption calculation is done but the encrypted result is invisible to mspi, 3: the encrypted result is visible to mspi.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
