espressif/esp-bist/src/soc/esp32c61/esp32c61.svd
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXFIFO_FULL</name>
              <description>Write 1 to clear UART_RXFIFO_FULL_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TXFIFO_EMPTY</name>
              <description>Write 1 to clear UART_TXFIFO_EMPTY_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PARITY_ERR</name>
              <description>Write 1 to clear UART_PARITY_ERR_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FRM_ERR</name>
              <description>Write 1 to clear UART_FRM_ERR_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>Write 1 to clear UART_RXFIFO_OVF_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DSR_CHG</name>
              <description>Write 1 to clear UART_DSR_CHG_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CTS_CHG</name>
              <description>Write 1 to clear UART_CTS_CHG_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BRK_DET</name>
              <description>Write 1 to clear UART_BRK_DET_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RXFIFO_TOUT</name>
              <description>Write 1 to clear UART_RXFIFO_TOUT_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SW_XON</name>
              <description>Write 1 to clear UART_SW_XON_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SW_XOFF</name>
              <description>Write 1 to clear UART_SW_XOFF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>GLITCH_DET</name>
              <description>Write 1 to clear UART_GLITCH_DET_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TX_BRK_DONE</name>
              <description>Write 1 to clear UART_TX_BRK_DONE_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TX_BRK_IDLE_DONE</name>
              <description>Write 1 to clear UART_TX_BRK_IDLE_DONE_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TX_DONE</name>
              <description>Write 1 to clear UART_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RS485_PARITY_ERR</name>
              <description>Write 1 to clear UART_RS485_PARITY_ERR_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RS485_FRM_ERR</name>
              <description>Write 1 to clear UART_RS485_FRM_ERR_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RS485_CLASH</name>
              <description>Write 1 to clear UART_RS485_CLASH_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AT_CMD_CHAR_DET</name>
              <description>Write 1 to clear UART_AT_CMD_CHAR_DET_INT.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Write 1 to clear UART_WAKEUP_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <description>Clock divider configuration</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x000002B6</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Configures the integral part of the divisor for baud rate generation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAG</name>
              <description>Configures the fractional part of the divisor for baud rate generation.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_FILT</name>
          <description>RX filter configuration</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>GLITCH_FILT</name>
              <description>Configures the width of a pulse to be filtered.\\Measurement unit: UART Core's clock cycle.\\Pulses whose width is lower than this value will be ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLITCH_FILT_EN</name>
              <description>Configures whether or not to enable RX signal filter.\\
0: Disable\\
1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>UART status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0xE000C000</resetValue>
          <fields>
            <field>
              <name>RXFIFO_CNT</name>
              <description>Represents the number of valid data bytes in RX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSRN</name>
              <description>Represents the level of the internal UART DSR signal.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTSN</name>
              <description>Represents the level of the internal UART CTS signal.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXD</name>
              <description>Represents the  level of the internal UART RXD signal.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFO_CNT</name>
              <description>Represents the number of valid data bytes in RX FIFO.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DTRN</name>
              <description>Represents the level of the internal UART DTR signal.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTSN</name>
              <description>Represents the level of the internal UART RTS signal.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXD</name>
              <description>Represents the  level of the internal UART TXD signal.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF0</name>
          <description>Configuration register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001C</resetValue>
          <fields>
            <field>
              <name>PARITY</name>
              <description>Configures the parity check mode.\\
0: Even parity\\
1: Odd parity\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITY_EN</name>
              <description>Configures whether or not to enable UART parity check.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_NUM</name>
              <description>Configures the number of data bits.\\
0: 5 bits\\
1: 6 bits\\
2: 7 bits\\
3: 8 bits\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_BIT_NUM</name>
              <description>Configures the number of stop bits.\\
0: Invalid. No effect\\
1: 1 bits\\
2: 1.5 bits\\
3: 2 bits\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXD_BRK</name>
              <description>Configures whether or not to send NULL characters when finishing data transmission.\\
0: Not send\\
1: Send\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_DPLX</name>
              <description>Configures whether or not to enable IrDA loopback test.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_TX_EN</name>
              <description>Configures whether or not to enable the IrDA transmitter.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_WCTL</name>
              <description>Configures the 11th bit of the IrDA transmitter.\\
0: This bit is 0.\\
1: This bit is the same as the 10th bit.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_TX_INV</name>
              <description>Configures whether or not to invert the level of the IrDA transmitter.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_RX_INV</name>
              <description>Configures whether or not to invert the level of the IrDA receiver.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPBACK</name>
              <description>Configures whether or not to enable UART loopback test.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_FLOW_EN</name>
              <description>Configures whether or not to enable flow control for the transmitter.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_EN</name>
              <description>Configures whether or not to enable IrDA protocol.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXD_INV</name>
              <description>Configures whether or not to invert the level of UART RXD signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXD_INV</name>
              <description>Configures whether or not to invert the level of UART TXD signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_RX_DAT_OVF</name>
              <description>Configures whether or not to disable data overflow detection for the UART receiver.\\
0: Enable\\
1: Disable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_WR_MASK</name>
              <description>Configures whether or not to store the received data with errors into FIFO.\\
0: Store\\
1: Not store\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOBAUD_EN</name>
              <description>Configures whether or not to enable baud rate detection.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_EN</name>
              <description>Configures whether or not to enable clock gating for UART memory.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_RTS</name>
              <description>Configures the RTS signal used in software flow control.\\
0: The UART transmitter is allowed to send data.\\
1: The UART transmitted is not allowed to send data.\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_RST</name>
              <description>Configures whether or not to reset the UART RX FIFO.\\
0: Not reset\\
1: Reset\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_RST</name>
              <description>Configures whether or not to reset the UART TX FIFO.\\
0: Not reset\\
1: Reset\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF1</name>
          <description>Configuration register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00006060</resetValue>
          <fields>
            <field>
              <name>RXFIFO_FULL_THRHD</name>
              <description>Configures the threshold for RX FIFO being full.\\Measurement unit: byte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_EMPTY_THRHD</name>
              <description>Configures the threshold for TX FIFO being empty.\\Measurement unit: byte.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTS_INV</name>
              <description>Configures whether or not to invert the level of UART CTS signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSR_INV</name>
              <description>Configures whether or not to invert the level of UART DSR signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_INV</name>
              <description>Configures whether or not to invert the level of UART RTS signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTR_INV</name>
              <description>Configures whether or not to invert the level of UART DTR signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_DTR</name>
              <description>Configures the DTR signal used in software flow control.\\
0: Data to be transmitted is not ready.\\
1: Data to be transmitted is ready.\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures clock gating.\\
0: Support clock only when the application writes registers.\\
1: Always force the clock on for registers.\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWFC_CONF</name>
          <description>Hardware flow control configuration</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_FLOW_THRHD</name>
              <description>Configures the maximum number of data bytes that can be received  during hardware flow control.\\Measurement unit: byte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FLOW_EN</name>
              <description>Configures whether or not to enable the UART receiver.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
